#+STARTUP: hidestars content
* Кастомная конфигурация
  :LOGBOOK:
  CLOCK: [2019-01-31 Thu 17:02]--[2019-01-31 Thu 18:35] =>  1:33
  CLOCK: [2019-01-30 Wed 17:13]--[2019-01-30 Wed 17:14] =>  0:01
  CLOCK: [2019-01-30 Wed 12:36]--[2019-01-30 Wed 13:28] =>  0:52
  CLOCK: [2019-01-30 Wed 10:01]--[2019-01-30 Wed 10:14] =>  0:13
  CLOCK: [2019-01-29 Tue 21:05]--[2019-01-29 Tue 22:01] =>  0:56
  :END:

    
*** Режим изменения размера
    :LOGBOOK:
    CLOCK: [2019-01-31 Thu 13:59]--[2019-01-31 Thu 13:59] =>  0:00
    :END:

    #+BEGIN_SRC shell :tangle ~/.config/i3/config
      mode "resize" {
              # These bindings trigger as soon as you enter the resize mode

              # Pressing left will shrink the window’s width.
              # Pressing right will grow the window’s width.
              # Pressing up will shrink the window’s height.
              # Pressing down will grow the window’s height.
              bindsym j resize shrink width 10 px or 10 ppt
              bindsym k resize grow height 10 px or 10 ppt
              bindsym l resize shrink height 10 px or 10 ppt
              bindsym semicolon resize grow width 10 px or 10 ppt

              # same bindings, but for the arrow keys
              bindsym Left resize shrink width 10 px or 10 ppt
              bindsym Down resize grow height 10 px or 10 ppt
              bindsym Up resize shrink height 10 px or 10 ppt
              bindsym Right resize grow width 10 px or 10 ppt

              # back to normal: Enter or Escape or $mod+r
              bindsym Return mode "default"
              bindsym Escape mode "default"
              bindsym $mod+r mode "default"
      }
    #+END_SRC

*** системный режим выключения/перезагрузки
    :LOGBOOK:
    CLOCK: [2019-01-30 Wed 17:14]--[2019-01-30 Wed 17:15] =>  0:01
    :END:

    #+BEGIN_SRC shell :tangle ~/.config/i3/config
      mode "sys" {
                 #reboot system
                 bindsym r exec "sudo shutdown -r 0"
                 #poweroff
                 bindsym p exec "sudo shutdown -P 0"
                 #exit
                 bindsym e exec "i3-msg exit"
                 bindsym Escape mode "default"
      }
    #+END_SRC
  
      
